После того как изменили количество показателей, наверное нужно изменить расчет квадратов.

Например выше указала все высокие баллы, а он рассчитал как средние показатели у Барановой Иры, хотя если везде высший бал, то это это Мушкетер должен быть. 

2.) Вот в таблицу еще нужно добавить вот это. 
В колонку портрет,в зависимости от квадрата необходимо заполнить вот так:
 
9. Мушкетеры :  Главная элита.
8. Самородки: Генераторы идей с горящими глазами.
7. Фантазеры : Активные сотрудники,но регулярно косячат.
6. Пчелы-труженицы :Супер-надежные исполнители с хорошей гибкостью.
5. Рабочие муравьи: Костяк бэк-офиса. 
4. Улитки: Стараются, не бунтуют, но работают очень медленно.
3. Хранители традиций:Мега-опытные «зубры».
2. Пассажир: Сотрудники, которые ментально уже уволились.
1. Якоря :  Самый тяжелый случай. 

Чтобы в таблице был и квадрат и краткий портрет.

 3.) А вот  уже на квадратах мы расписываем подробно в всплывающих окнах 
ПОРТРЕТ :
9. Мушкетеры :  портрет_мушк
8. Самородки: портрет_сам
7. Фантазеры : портрет_фант
6. Пчелы-труженицы :портрет_пч
5. Рабочие муравьи: портрет_мур
4. Улитки: портрет_ул
3. Хранители традиций:портрет_хр
2. Пассажир: портрет_пас
1. Якоря :  портрет_як

РИСК :
9. Мушкетеры :  риск_мушк
8. Самородки: риск_сам
7. Фантазеры : риск_фант
6. Пчелы-труженицы :риск_пч
5. Рабочие муравьи: риск_мур
4. Улитки: риск_ул
3. Хранители традиций:риск_хр
2. Пассажир: риск_пас
1. Якоря :  риск_як

Решение :
9. Мушкетеры :  реш_мушк
8. Самородки: реш_сам
7. Фантазеры : реш_фант
6. Пчелы-труженицы :реш_пч
5. Рабочие муравьи: реш_мур
4. Улитки: реш_ул
3. Хранители традиций:реш_хр
2. Пассажир: реш_пас
1. Якоря :  реш_як

 
3.) Ср.Эфф нужно заменить на Ср. Прд
